[
    {
        "Book": "I",
        "Quote": " \"Aren't you two ever going to read Hogwarts: A History?\"\n\n\"What's the point? You know it all by heart, we can just ask you.\" "
    },
    {
        "Book": "I",
        "Quote": "\"...before we begin our banquet, I would like to say a few words.  And here they are: Nitwit! Blubber! Oddment! Tweak!\""
    },
    {
        "Book": "I",
        "Quote": "\"Alas! Ear wax!\""
    },
    {
        "Book": "I",
        "Quote": "\"And no wonder we couldn't find Flamel in that Study of Recent Developments in Wizardry,\" said Ron. \"He's not exactly recent if he's six-hundred and sixty-five, is he?\""
    },
    {
        "Book": "I",
        "Quote": "\"Comb your hair!\" he barked, by way of a morning greeting."
    },
    {
        "Book": "I",
        "Quote": "\"Hagrid, you live in a wooden house,\" she said.\n\nBut Hagrid wasn't listening.  He was humming merrily as he stoked the fire."
    },
    {
        "Book": "I",
        "Quote": "\"I believe your friends Misters Fred and George Weasley were responsible for trying to send you a toilet seat. No doubt they thought it would amuse you.\""
    },
    {
        "Book": "I",
        "Quote": "\"It's obvious,\" said Ron. \"You can pretend to be waiting for Professor Flitwick, you know.\" He put on a high voice, \"'Oh, Professor Flitwick, I'm so worried, I think I got question fourteen b wrong...'\" "
    },
    {
        "Book": "I",
        "Quote": "\"Longbottom, if brains were gold, you'd be poorer than Weasley, and that's saying something.\" "
    },
    {
        "Book": "I",
        "Quote": "\"Meant ter turn him into a pig, but I suppose he was so much like a pig anyway there wasn't much left ter do.\""
    },
    {
        "Book": "I",
        "Quote": "\"P for prefect! Get it on, Percy, come on, we're all wearing ours, even Harry got one.\"\n\n\"I - don't - want -\" said Percy thickly, as the twins forced the sweater over his head, knocking his glasses askew.\n\n\"And you're not sitting with the prefects today either,\" said George. \"Christmas is a time for family.\"\n\nThey frog-marched Percy from the room, his arms pinned to his sides by his sweater."
    },
    {
        "Book": "I",
        "Quote": "\"Scars can come in handy. I have one myself above my left knee that is a perfect map of the London Underground.\" "
    },
    {
        "Book": "I",
        "Quote": "\"So you mean the Stone's only safe as long as Quirrell stands up to Snape?\" said Hermione in alarm.\n\n\"It'll be gone by next Tuesday,\" said Ron."
    },
    {
        "Book": "I",
        "Quote": "\"Stop moving!\" Hermione ordered them. \"I know what this is-it's the Devil's Snare!\" \n\n\"Oh, I'm so glad we know what it's called, that's a great help,\" snarled Ron, leaning back, trying to stop the plant from curling around his neck. "
    },
    {
        "Book": "I",
        "Quote": "\"Sunshine, daisies, butter mellow,\nTurn this stupid, fat rat yellow.\""
    },
    {
        "Book": "I",
        "Quote": "\"And what if I wave my wand and nothing happens?\"\n\n\"Throw it away and punch him in the nose,\" suggested Ron."
    },
    {
        "Book": "I",
        "Quote": "\"He's got lots o'rats and some brandy for the journey,\" said Hagrid in a muffled voice.  \"An\" I packed his teddy bear in case he gets lonely.\"\n\nFrom inside the crate came some ripping noises that sounded to Harry as though the teddy was having his head torn off."
    },
    {
        "Book": "I",
        "Quote": "\"I can't believe you're going to do this, Harry.\"\n\nA lamp flickered on.  It was Hermione Granger, wearing a pink bathrobe and a frown."
    },
    {
        "Book": "I",
        "Quote": "\"I couldn't help overhearing what you and Malfoy were saying-\"\n\n\"Bet you could,\" Ron muttered."
    },
    {
        "Book": "I",
        "Quote": "\"I tell you, that dragon's the most horrible animal I ever met, but the way Hagrid goes in about it, you'd think it was a fluffy little bunny rabbit.  When it bit me he told me off for frightening it. And when I left , he was singing a lullaby.\""
    },
    {
        "Book": "I",
        "Quote": "\"I'm not Fred, I'm George,\" said the boy. \"Honestly, woman, you call yourself our mother! Can't you tell I'm George?\"\n\n\"Sorry, George, dear.\"\n\n\"Only joking, I am Fred,\" said the boy, and off he went."
    },
    {
        "Book": "I",
        "Quote": "\"It's lucky it's dark. I haven't blushed so much since Madam Pomfrey told me she liked my new earmuffs.\""
    },
    {
        "Book": "I",
        "Quote": "\"So light a fire!\" Harry choked.\n\n\"Yes... of course... but there's no wood!\" Hermione cried, wringing her hands.\n\n\"HAVE YOU GONE MAD!\" Ron bellowed. \"ARE YOU A WITCH OR NOT?\""
    },
    {
        "Book": "I",
        "Quote": "\"So, I suppose you think that's a reward for breaking the rules?\" came an angry voice from behind them...\n\n\"I thought you weren't speaking to us?\" said Harry.\n\n\"Yes, don't stop now,\" said Ron, \"It's doing us so much good.\" "
    },
    {
        "Book": "I",
        "Quote": "\"They stuff people's heads down the toilet the first day at Stonewall,\" Dudley told Harry. \"Want to come upstairs and practice?\"\n\"No, thanks,\" said Harry. \"The poor toilet's never had anything as horrible as your head down it - it might be sick.\""
    },
    {
        "Book": "I",
        "Quote": "\"Typical,\" said Harry darkly. \"Just what I always wanted. To make a fool of myself on a broomstick in front of Malfoy.\""
    },
    {
        "Book": "I",
        "Quote": "\"What do you see when you look in the Mirror?\"\n\n\"I? I see myself holding a pair of thick, woollen socks.\"\n\nHarry stared.\n\n\"One can never have enough socks,\" said Dumbledore. \"Another Christmas has come and gone and I didn't get a single pair. People will insist on giving me books.\""
    },
    {
        "Book": "I",
        "Quote": "\"You haven't got a letter on yours,\" George observed. \"I suppose she thinks you don't forget your name. But we're not stupid - we know we're called Gred and Forge.\""
    },
    {
        "Book": "I",
        "Quote": "Everybody finished the song at different times. At last, only the Weasley twins were left singing along to a very slow funeral march."
    },
    {
        "Book": "I",
        "Quote": "Harry sniffed and a foul stench reached his nostrils, a mixture of old socks and the kind of public toilet no one seems to clean."
    },
    {
        "Book": "I",
        "Quote": "He had never been more nervous, never, not even when he'd had to take a report home to the Dursleys saying he'd somehow turned his teacher's wig blue."
    },
    {
        "Book": "I",
        "Quote": "Hermione wasn't going to give up that easily.  She followed Ron through the portrait hole, hissing at them like an angry goose."
    },
    {
        "Book": "I",
        "Quote": "Lee Jordan was finding it difficult not to take sides.\n\n\"So-after that obvious and disgusting bit of cheating-\"\n\n\"Jordan!\" growled Professor McGonagall.\n\n\"I mean, after that open and revolting foul-\" \n\n\"Jordan, I'm warning you-\"\n\n\"All right, all right. Flint nearly kills the Gryffindor Seeker, which could happen to anyone, I'm sure...\""
    },
    {
        "Book": "I",
        "Quote": "Neville had never been on a broomstick in his life, because his grandmother had never let him near one.  Privately, Harry felt she'd had good reason, because Neville managed to have an extraordinary number of accidents even with both feet on the ground."
    },
    {
        "Book": "I",
        "Quote": "One morning in mid-December, Hogwarts woke to find itself covered in several feet of snow. The lake froze solid and the Weasley twins were punished for bewitching several snowballs so that they followed Quirrell around, bouncing off the back of his turban."
    },
    {
        "Book": "I",
        "Quote": "Perhaps brooms, like horses, could tell when you were afraid, thought Harry; there was a quaver in Neville's voice that said only too clearly that he wanted to keep his feet on the ground."
    },
    {
        "Book": "I",
        "Quote": "Speaking quietly so that no one else would hear, Harry told the other two about Snape's sudden, sinister desire to be a Quidditch referee.\n\n\"Don't play,\" said Hermione at once.\n\n\"Say you're ill,\" said Ron.\n\n\"Pretend to break your leg,\" Hermione suggested.\n\n\"Really break your leg,\" said Ron."
    },
    {
        "Book": "I",
        "Quote": "The tub was full of what looked like dirty rags swimming in gray water.\n\n\"What's this?\" He asked Aunt Petunia.  Her lips tightened as they always did if he dared to ask a question.\n\n\"Your new school uniform,\" she said.\n\nHarry looked in the bowl again.\n\n\"Oh,\" he said, \"I didn't realize it had to be so wet.\"\n\n\"Don't be stupid,\" snapped Aunt Petunia.  \"I'm dyeing some of Dudley's old things gray for you.  It'll look like everyone else's when I've finished.\"\n\nHarry seriously doubted this, but he thought it best not to argue.  He sat down at the table and tried not to think about how he was going to look in his first day at Stonewall High - like he was wearing bits of old elephant skin, probably."
    },
    {
        "Book": "I",
        "Quote": "When they told him about Charlie's letter, his eyes filled with tears, although it might have been because Norbert had just bitten him on the leg."
    },
    {
        "Book": "I",
        "Quote": "Wood? thought Harry, bewildered; was Wood a cane she was going to use on him?"
    },
    {
        "Book": "II",
        "Quote": "\"I know what day it is,\" sang Dudley, waddling towards him.\n\nThe huge eyes blinked and vanished.\n\n\"What?\" said Harry, not taking his eyes off the spot where they had been.\n\n\"I know what day it is,\" Dudley repeated, coming right up to him.\n\n\"Well done,\" said Harry. \"So you've finally learned the days of the week.\""
    },
    {
        "Book": "II",
        "Quote": "\"Perfect ... Dudley?\"\n\n\"How about: \"We had to write an essay about our hero at school, Mr Mason, and I wrote about you.\" \"\n\nThis was too much for both Aunt Petunia and Harry. Aunt Petunia burst into tears and hugged her son, while Harry ducked under the table so they wouldn't see him laughing."
    },
    {
        "Book": "II",
        "Quote": "\"Somewhere over there,\" said Ron, pointing along the shelves. \"Looking for another book. I think she's trying to read the whole library before Christmas.\""
    },
    {
        "Book": "II",
        "Quote": "\"All we'd need is some Polyjuice Potion.\"\n\n\"What's that?\" said Ron and Harry together.\n\n\"Snape mentioned it in class a few weeks ago-\"\n\n\"D'you think we've got nothing better to do in Potions than listen to Snape?\" muttered Ron."
    },
    {
        "Book": "II",
        "Quote": "\"Azkaban - the wizard prison, Goyle,\" said Malfoy, looking at him in disbelief.  \"Honestly, if you were any slower, you'd be going backwards.\""
    },
    {
        "Book": "II",
        "Quote": "\"Could've been anything,\" said Ron. \"Maybe he got thirty O.W.L.s or saved a teacher from the giant squid. Maybe he murdered Myrtle; that would've done everyone a favor...\" "
    },
    {
        "Book": "II",
        "Quote": "\"Filth!\" He shouted, his jowls aquiver, his eyes popping alarmingly as he pointed at the muddy puddle that had dropped from Harry's Quidditch robes."
    },
    {
        "Book": "II",
        "Quote": "\"Half an inch of skin and sinew holding my neck on, Harry! Most people would think that's good as beheaded, but oh, no, it's not enough for Sir Properly Decapitated-Podmore.\" "
    },
    {
        "Book": "II",
        "Quote": "\"He sounds like Percy,\" said Ron, wrinkling his nose in disgust. \"Prefect, Head Boy... probably top of every class-\"\n\n\"You say that like it's a bad thing,\" said Hermione in a slightly hurt voice."
    },
    {
        "Book": "II",
        "Quote": "\"I know, I know -- it's not quite as good as winning Witch Weekly's Most-Charming-Smile Award five times in a row, as I have -- but it's a start, Harry, it's a start!\""
    },
    {
        "Book": "II",
        "Quote": "\"I seem to remember telling you both that I would have to expel you if you broke any more school rules,\" said Dumbledore. \n\nRon opened his mouth in horror. \n\n\"Which goes to show that the best of us must sometimes eat our words.\" "
    },
    {
        "Book": "II",
        "Quote": "\"It only put me in Gryffindor ,\" said Harry in a defeated voice, \"because I asked not to go into Slytherin...\"\n\n\"Exactly,\" said Dumbledore, beaming once more.  \"Which makes you very different from Tom Riddle.  It is our choices, Harry, that show what we truly are, far more than our abilities.\""
    },
    {
        "Book": "II",
        "Quote": "\"Oh that,\" said Ginny, giggling. \"Well - Percy's got a girlfriend.\" \n\nFred dropped a stack of books on George's head. \"What?\" \n\n\"It's that Ravenclaw prefect, Penelope Clearwater,\" said Ginny. \"That's who he was writing to all last summer. He's been meeting her all over the school in secret. I walked in on them kissing in an empty classroom one day. He was so upset when she was - you know - attacked. You won't tease him, will you?\" she added anxiously. \n\n\"Wouldn't dream of it,\" said Fred, who was looking like his birthday had come early. \n\n\"Definitely not,\" said George, sniggering"
    },
    {
        "Book": "II",
        "Quote": "\"Really, Severus,\" said Prof McGonagall sharply, \"I see no reason to stop the boy playing Quidditch.  This cat wasn't hit over the head with a broomstick.\""
    },
    {
        "Book": "II",
        "Quote": "\"There might be a way,\" said Hermione slowly, deropping her voice still further with a quick glance across the room at Percy. \"Of course, it would be difficult. And dangerous, very dangerous. We'd be breaking about fifty school rules, I expect-\"\n\n\"If, in a month or so, you feel like explaining, you will let us know, won't you?\" said Ron irritably."
    },
    {
        "Book": "II",
        "Quote": "\"\"Hello, Hagrid, tell us, have you been setting anything mad and hairy loose in the castle lately?''\""
    },
    {
        "Book": "II",
        "Quote": "\"This is all your fault,\" George said angrily to Wood. \"\" Get the Snitch or die trying,\" what a stupid thing to tell him-\""
    },
    {
        "Book": "II",
        "Quote": "\"Why didn't you send us a letter by owl? I believe you have an owl?\" Professor McGonagall said coldly to Harry.\n\nHarry gaped at her. Now she'd said it, that seemed the obvious thing to have done.\n\n\"I - I didn't think -\"\n\n\"That,\" said Professor McGonagall, \"is obvious.\""
    },
    {
        "Book": "II",
        "Quote": "\"Why're you staring at the hedge?\" he said suspiciously.\n\n\"I'm trying to decide what would be the best spell to set it on fire,\" said Harry.\n\nDudley stumbled backward at once, a look of panic on his fat face.\n\n\"You c-can't - Dad told me you're not to do m-magic - he said he'll chuck you out of the house - and you haven't got anywhere else to go - you haven't got any friends to take you -\"\n\n\"Jiggery pokery!\" said Harry in a fierce voice. \"Hocus pocus - squiggly wiggly -\""
    },
    {
        "Book": "II",
        "Quote": "\"You're alive,\" she said blankly to Harry.\n\n\"There's no need to sound so disappointed,\" he said grimly, wiping flecks of blood and slime off his glasses."
    },
    {
        "Book": "II",
        "Quote": "Fred and George, however, found all this very funny. They went out of their way to march ahead of Harry down the corridors, shouting, \"Make way for the heir of Slytherin, seriously evil wizard coming through ...\"\n\nPercy was deeply disapproving of this behavior.\n\n\"It is not a laughing matter,\" he said coldly.\n\n\"Oh, get out of the way, Percy,\" said Fred, \"Harry's in a hurry.\"\n\n\"Yeah, he's nipping off to the Chamber of Secrets for a cup of tea with his fanged servant,\" said George, chortling. "
    },
    {
        "Book": "II",
        "Quote": "Harry looked up nervously at Lockhart and said, \"Professor, could you show me that blocking spell again?\"\n\n\"Scared?\" muttered Malfoy, so that Lockhart couldn't hear him.\n\n\"You wish,\" said Harry out of the corner of his mouth.\n\nLockhart cuffed Harry merrily on the shoulder.  \"Just do what I did, Harry!\"\n\n\"What, drop my wand?\""
    },
    {
        "Book": "II",
        "Quote": "Jiggery pokery!\" said Harry in a fierce voice. \"Hocus pocus - squiggly wiggly -\"\n\n\"MUUUUUUM!\" howled Dudley, \"He's doing you know what!\""
    },
    {
        "Book": "II",
        "Quote": "Madam Pince, the librarian, was a thin, irritable woman who looked like an underfed vulture."
    },
    {
        "Book": "II",
        "Quote": "Malfoy strutted over, smirking.  Behind him walked a Slytherin girl who reminded Harry of a picture he'd seen in Holidays with Hags. She was large and square and her heavy jaw jutted aggressively."
    },
    {
        "Book": "II",
        "Quote": "Mrs. Weasley was marching across the yard, scattering chickens, and for a short, plump, kind faced woman, it was remarkable how much she looked like a saber-toothed tiger."
    },
    {
        "Book": "II",
        "Quote": "Percy, who hadn't noticed that Fred had bewitched his prefect badge so that it now read \"Pinhead,\" kept asking them all what they were sniggering at. "
    },
    {
        "Book": "II",
        "Quote": "Snape given them so much homework, Harry thought he was likely to be in the sixth year before he finished it."
    },
    {
        "Book": "II",
        "Quote": "They had hoped that Goyle, who was almost as stupid as he was mean, might be thrown out, but he had passed, too.  It was a shame, but as Ron said, you couldn't have everything in life."
    },
    {
        "Book": "III",
        "Quote": "\"Gryffindor haven't won for seven years now. OK, so we've had the worst luck in the world - injuries - then the tournament getting called off last year ...\" Wood swallowed, as though the memory still brought a lump to his throat. \"But we also know we've got the best - ruddy - team - in - the - school,\" he said, punching a fist into his other hand, the old manic glint back in his eye.\n\n\n\n\"We've got three superb Chasers.\"\n\n\n\nWood pointed at Alicia Spinnet, Angelina Johnson and Katie Bell.\n\n\n\n\"We've got two unbeatable Beaters.\"\n\n\n\n\"Stop it, Oliver, you're embarrassing us,\" said Fred and George Weasley together, pretending to blush.\n\n\n\n\"And we've got a Seeker who has never failed to win us a match!\" Wood rumbled, glaring at Harry with a kind of furious pride. \"And me,\" he added, as an afterthought.\n\n\n\n\"We think you're very good, too, Oliver,\" said George.\n\n\n\n\"Cracking Keeper,\" said Fred."
    },
    {
        "Book": "III",
        "Quote": "\"He bit Goyle for us once!\" Ron said miserable. \"Remember Harry?\"\n\n\"Yeah, that's true,\" said Harry.\n\n\"His finest hour,\" said Fred, unable to keep a straight face. \"Let the scar on Goyle's finger stand as a lasting tribute to his memory...\""
    },
    {
        "Book": "III",
        "Quote": "\"We let off a Dungbomb in the corridor and it upset him for some reason -\"\n\n\"So he hauled us off to his office and started threatening us with the usual -\"\n\n\"- detention -\"\n\n\"- disembowelment - \""
    },
    {
        "Book": "III",
        "Quote": "\"Bad news, Harry. I've just been to see Professor McGonagall about the Firebolt. She - er got a bit shirty with me. Told me I'd got my priorities wrong. Seemed to think I cared more about winning the Cup than I do about staying alive. Just because I told her I didn't care if it threw you off, as long as you caught the Snitch first.\""
    },
    {
        "Book": "III",
        "Quote": "\"But one does not parade the fact that one is All-Knowing.  I frequently act as though I am not possessed of the Inner Eye, so as not to make others nervous.\"\n\n\"That explains a great deal, \"said Professor McGonagall tartly."
    },
    {
        "Book": "III",
        "Quote": "\"But you're Muggles! We must have a drink! What's that you've got there? Oh, you're changing Muggle money. Molly, look!\" "
    },
    {
        "Book": "III",
        "Quote": "\"Come on, Ron, you were always saying how boring Scabbers was,\" said Fred bracingly. \"And he's been off-colour for ages, he was wasting away. It was probably better for him to snuff it quickly. One swallow - he probably didn't feel a thing.\""
    },
    {
        "Book": "III",
        "Quote": "\"Hermione, what's gotten into you lately!\" said Ron astounded.  \"First you hit Malfoy, then you walk out on Professor Trelawney-\"\n\nHermione looked rather flattered."
    },
    {
        "Book": "III",
        "Quote": "\"I don't want a connection with Pettigrew!\" said Harry.  \"He betrayed my parents!\"\n\n\"This is magic at its deepest, its most impenetrable, Harry.  But trust me.... the time may come when you will be very glad you saved Pettigrew's life\"."
    },
    {
        "Book": "III",
        "Quote": "\"I have been crystal gazing, Headmaster,\" said Professor Trelawney in her mistiest, most faraway voice, \"and to my astonishment, I saw myself abandoning my solitary luncheon and coming to join you.  Who am I to refuse the promptings of fate?\""
    },
    {
        "Book": "III",
        "Quote": "\"If you made a better rat than a human, that's not much to boast about.\" "
    },
    {
        "Book": "III",
        "Quote": "\"Oh, my dear boy, we're not going to punish you for a little thing like that!\" cried Fudge, waving his crumpet impatiently.  \"It was an accident!  We don't send people to Azkaban just for blowing up their aunts!\""
    },
    {
        "Book": "III",
        "Quote": "\"The fates have informed me that your examination in June will concern the Orb, and I am anxious to give you sufficient practice.\n\nHermione snorted.\n\n\"Well honestly. . . \"the fates have informed her'. . . Who sets the exam? She does!\" "
    },
    {
        "Book": "III",
        "Quote": "\"The Ministry's providing a couple of cars,\" said Mr. Weasley. Everyone looked up at him.\n\n\"Why?\" said Percy, curiously.\n\n\"It's because of you, Perce,\" said George seriously. \"And there'll be little flags on the hoods, with HB on them -\"\n\n\"- For Humongous Bighead,\" said Fred.\n\nEveryone except Percy and Mrs. Weasley snorted into their pudding."
    },
    {
        "Book": "III",
        "Quote": "\"We tried to shut him in a pyramid, but Mum spotted us.\""
    },
    {
        "Book": "III",
        "Quote": "\"Well... when we were in our first year, Harry - young, carefree and innocent -\"\n\nHarry snorted. He doubted whether Fred and George had ever been innocent.\n\n\"- well, more innocent than we are now-\""
    },
    {
        "Book": "III",
        "Quote": "\"What would your head have been doing in Hogsmeade, Potter?\" said Snape softly. \"Your head is not allowed in Hogsmeade. No part of your body has permission to be in Hogsmeade.\""
    },
    {
        "Book": "III",
        "Quote": "\"Would anyone like me to help them interpret the shadowy portents within their Orb?\" she murmured over the clinking of her bangles. \n\n\"I don't need help,\" Ron whispered. \"It's obvious what this means. There's going to be loads of fog tonight. \"\n\nBoth Harry and Hermione burst out laughing. "
    },
    {
        "Book": "III",
        "Quote": "\"Wow, I wonder what it'd be like to have a difficult life?\""
    },
    {
        "Book": "III",
        "Quote": "\"Divination is one of the most imprecise branches of magic. I shall not conceal from you that I have very little patience with it. True seers are very rare, and Professor Trelawney...\"\n\nShe stopped again, and then said, in a very matter-of-fact tone, \"You look in excellent health to me, Potter, so you will excuse me if I don't let you off homework today. I assure you that if you die, you need not hand it in.\""
    },
    {
        "Book": "III",
        "Quote": "\"Godfather?\" sputtered Uncle Vernon. \"You haven't got a godfather!\"\n\n\"Yes, I have,\" said Harry brightly. \"He was my mum and dad's best friend. He's a convicted murderer, but he's broken out of wizard prison and he's on the run. He likes to keep in touch with me, though...keep up with my news...check if I'm happy...\""
    },
    {
        "Book": "III",
        "Quote": "\"Harry!\" said Fred, elbowing Percy out of the way and bowing deeply. \"Simply splendid to see you, old boy-\"\n\n\"Marvelous,\" said George, pushing Fred aside and seizing Harry's hand in turn. \"Absolutely spiffing.\"\n\nPercy scowled.\n\n\"That's enough, now,\" said Mrs. Weasley.\n\n\"Mum!\" said Fred as though he'd only just spotted her and seizing her hand too. \"How really corking to see you-\""
    },
    {
        "Book": "III",
        "Quote": "\"He seems like a very good teacher,\" said Hermione approvingly. \"But I wish I could have had a turn with the boggart -\"\n\n\"What would it have been for you?\" said Ron, sniggering, \"A piece of homework that only got nine out of ten?\""
    },
    {
        "Book": "III",
        "Quote": "\"Oh, are you a Prefect, Percy?\" said one of the twins, with an air of great surprise. \"You should have said something, we had no idea.\"\n\n\"Hang on, I think I remember him saying something about it,\" said the other twin. \"Once -\"\n\n\"Or twice -\"\n\n\"A minute -\"\n\n\"All summer -\""
    },
    {
        "Book": "III",
        "Quote": "\"Right, you've got a wonky sort of cross...\" he said, consulting Unfogging the Future. \"That means you're going to have \"trials and suffering\" - sorry about that - but there's a thing that could be a sun. Hang on... that means \"great happiness'... so you're going to suffer but be very happy...\"\n\n\"You need your Inner Eye tested, if you ask me,\" said Ron, and they both had to stifle their laughs as Professor Trelawney gazed in their direction."
    },
    {
        "Book": "III",
        "Quote": "\"Sure you can manage that broom, Potter?\" said a cold, drawling voice. Draco Malfoy had arrived for a closer look, Crabbe and Goyle right behind him.\n\n\"Yeah, reckon so,\" said Harry casually.\n\n\"Got plenty of special features, hasn't it?\" said Malfoy, eyes glittering maliciously. \"Shame it doesn't come with a parachute - in case you get to near a Dementor.\" Crabbe and Goyle sniggered.\n\n\"Pity you can't attach an extra arm to yours, Malfoy,\" said Harry. \"Then it could catch the Snitch for you.\""
    },
    {
        "Book": "III",
        "Quote": "\"Well I dreamed I was playing Quidditch the other night,\" said Ron, screwing up his face in an effort to remember. \"What d'you reckon that means?\"\n\n\"Probably that you're going to be eaten by a giant marshmallow or something,\" said Harry."
    },
    {
        "Book": "III",
        "Quote": "\"Where is Wood?\" said Harry, suddenly realizing he wasn't there.\n\n\"Still in the showers,\" said Fred. \"We think he's trying to drown himself.\""
    },
    {
        "Book": "III",
        "Quote": "As though an invisible hand were writing upon it, words appeared on the smooth surface of the map. \"Mr. Moony presents his compliments to Professor Snape, and begs him to keep his abnormally large nose out of other people's business.\"\n\nSnape froze. Harry stared, dumbstruck, at the message. But the map didn't stop there. More writing was appearing beneath the first.\n\n\"Mr. Prongs agrees with Mr. Moony, and would like to add that Professor Snape is an ugly git.\"\n\nIt would have been funny if the situation hadn't been so serious. And there was more...\n\n\"Mr. Padfoot would like to register his astonishment that an idiot like that ever became a professor.\"\n\nHarry closed his eyes in horror. When he'd opened them, the map had had its last word.\n\n\"Mr. Wormtail bids Professor Snape good day, and advises him to wash his hair, the slimeball.\""
    },
    {
        "Book": "III",
        "Quote": "First he dreamed that he had overslept, and that Wood was yelling, \"Where were you? We had to use Neville instead!\""
    },
    {
        "Book": "III",
        "Quote": "Percy had what were possibly the least helpful words of comfort. \"They make a fuss about Hogsmeade, but I assure you, Harry, it's not all it's cracked up to be,\" he said seriously. \"All right, the sweetshops rather good, and Zonko's Joke Shop's frankly dangerous, and yes, the Shrieking Shack is always worth a visit, but really, Harry, apart from that, you're not missing anything.\""
    },
    {
        "Book": "III",
        "Quote": "They were watching a brand new television, a welcome-home-for-the-summer present for Dudley, who had been complaining loudly about the long walk between the fridge and living room.  Dudley had spent most of the summer in the kitchen, his piggy little eyes fixed on the screen and his five chins wobbling as he ate continually."
    },
    {
        "Book": "IV",
        "Quote": "\"Take it,\" Harry repeated firmly. \"I don't want it.\"\n\n\"You're mental,\" said George, trying to push it back at Harry.\n\n\"No, I'm not,\" said Harry. \"You take it, and get inventing. It's for the joke-shop.\"\n\n\"He is mental,\" Fred said, in an almost awed voice."
    },
    {
        "Book": "IV",
        "Quote": "\"Thought we'd see what those three were up to,\" said Fred matter-of-factly, stepping onto Goyle and into the compartment. He had his wand out, and so did George, who was careful to tread on Malfoy as he followed Fred inside.\n\n\"Interesting effect,\" said George, looking down at Crabbe. \"Who used the Furnunculus Curse?\"\n\n\"Me,\" said Harry.\n\n\"Odd,\" said George lightly, \"I used Jelly-Legs. Looks as though those two shouldn't be mixed.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Anyone can speak Troll,\" said Fred dismissively, \"all you have to do is point and grunt.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Colin, I fell in!\" he said shrilly, throwing himself into an empty seat. \"It was brilliant! And something in the water grabbed me and pushed me back in the boat!\"\n\n\"Cool!\" said Colin, just as excitedly. \"It was probably the giant squid, Dennis!\"\n\n\"Wow!\" said Dennis, as though nobody in their wildest dreams could hope for more than being thrown into a storm-tossed, fathoms-deep lake, and pushed out of it again by a giant sea monster."
    },
    {
        "Book": "IV",
        "Quote": "\"Did I tell you I've invented a broomstick that'll reach Jupiter?\" "
    },
    {
        "Book": "IV",
        "Quote": "\"Dumpy sort of woman?\" he growled finally.  \"Load of children with red hair?\"\n\nHarry frowned.  He thought it was a bit rich for Uncle Vernon to call anyone \"dumpy,\" when his own son Dudley had finally achieved what he'd been threatening to do since the age of three, and become wider than he was tall."
    },
    {
        "Book": "IV",
        "Quote": "\"Harry, I've been thinking - you know what we've got to do, don't you? Straight away, the moment we get back to the castle?\"\n\n\"Yeah, give Ron a good kick up the - \"\n\n\"Write to Sirius.\""
    },
    {
        "Book": "IV",
        "Quote": "\"I thought it sounded a bit like Percy singing... maybe you've got to attack him while he's in the shower, Harry.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Don't talk to me,\" Ron said quietly to Harry and Hermione, as they sat down at the Gryffindor table a few minutes later, surrounded by excited talk on all sides about what had just happened.\n\"Why not?\" said Hermione in surprise.\n\"Because I want to fix that in my memory for ever,\" said Ron, his eyes closed and an uplifted expression on his face. \"Draco Malfoy, the amazing bouncing ferret...\""
    },
    {
        "Book": "IV",
        "Quote": "\"I was saying that Saturn was surely in a position of power in the heavens at the moment of your birth...your dark hair...your mean stature...tragic losses so young in life...I think I am right in saying, my dear, that you were born in midwinter?\"\n\n\"No,\" said Harry, \"I was born in July.\"\n\nRon hastily turned his laugh into a hacking cough."
    },
    {
        "Book": "IV",
        "Quote": "\"It is Uranus, my dear,\" said Professor Trelawney peering down a the chart.\n\n\"Can I have a look at Uranus too, Lavender?\" said Ron."
    },
    {
        "Book": "IV",
        "Quote": "\"Just because it's taken you three years to notice, Ron, doesn't mean no one else has spotted I'm a girl!\" "
    },
    {
        "Book": "IV",
        "Quote": "\"Mr. Crouch!\" said Percy breathlessly, sunk into a kind of half-bow that made him look like a hunchback. \"Would you like a cup of tea?\"\n\n\"Oh,\" said Mr. Crouch, looking over at Percy in mild surprise. \"Yes - thank you, Weatherby.\"\n\nFred and George choked into their own cups. Percy, very pink around the ears, busied himself with the kettle."
    },
    {
        "Book": "IV",
        "Quote": "\"Of course we still want to know you!\" Harry said, staring at Hagrid.\n\n\"You don't think anything that Skeeter cow - sorry, Professor,\" he added quickly, looking at Dumbledore.\n\n\"I have gone temporarily deaf and haven't any idea what you said, Harry,\" said Dumbledore, twiddling his thumbs and staring at the ceiling."
    },
    {
        "Book": "IV",
        "Quote": "\"Oh, I would never dream of assuming I know all Hogwarts\" secrets, Igor,\" said Dumbledore amicably. \"Only this morning, for instance, I took a wrong turning on the way to the bathroom and found myself in a beautifully proportioned room I have never seen before, containing a really rather magnificent collection of chamberpots. When I went back to investigate more closely, I discovered that the room had vanished. But I must keep an eye out for it. Possibly it is only accessible at five thirty in the morning. Or it may only appear at the quarter moon - or when the seeker has an exceptionally full bladder.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Percy wouldn't notice a joke if it danced naked in front of him wearing one of Dobby's hats.\""
    },
    {
        "Book": "IV",
        "Quote": "\"That was an excellent breakfast, wasn't it?\" said Harry.  \"I feel really full, don't you?\""
    },
    {
        "Book": "IV",
        "Quote": "\"There you go, Harry! You weren't being thick after all -- you were just showing moral fiber!\""
    },
    {
        "Book": "IV",
        "Quote": "\"They've got an electric fire,\" Harry explained.\n\n\"Really?\" said Mr. Weasley's voice excitedly. \"Eclectic, you say? With a plug? Gracious, I must see that... Let's think...ouch, Ron!\"\n\nRon's voice now joined the others'. \n\n\"What are we doing here? Has something gone wrong?\" \n\n\"Oh no, Ron,\" came Fred's voice, very sarcastically. \"No, this is exactly where we want to end up.\"\n\n\"Yeah, we're having the time of our lives here,\" said George, whose voice sounded muffled, as though he was squashed against the wall."
    },
    {
        "Book": "IV",
        "Quote": "\"Twitchy little ferret, aren't you, Malfoy?\""
    },
    {
        "Book": "IV",
        "Quote": "\"What's that?\" said Ron, pointing at a large dish of some sort of shellfish stew that stood beside a large steak-and-kidnet pudding. \n\n\"Bouillabaisse,\" said Hermione. \n\n\"Bless you,\" said Ron. "
    },
    {
        "Book": "IV",
        "Quote": "\"Wild!\" he said, twiddling the replay knob on the side. I can make that old bloke down there pick his nose again... and again... and again...\""
    },
    {
        "Book": "IV",
        "Quote": "\"Wormtail, I need somebody with brains, somebody whose loyalty has never wavered, and you, unfortunately, fulfill neither requirement.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Aaaaah,\" said Ron, imitating Professor Trelawney's mystical whisper, \"when two Neptunes appear in the sky, it is a sure sign that a midget in glasses is being born, Harry...\""
    },
    {
        "Book": "IV",
        "Quote": "\"Congratulations, Harry!\" she said, beaming at him. \"I wonder if you could give me a quick word?\"\n\n\"Yeah, you can have a word,\" said Harry savagely. \"Good-bye.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Enjoying it?\" said Ron darkly. \"I don't reckon he'd come home if Dad didn't make him. He's obsessed. Just don't get him onto the subject of his boss. According to Mr. Crouch...as I was saying to Mr. Crouch...Mr. Crouch is of the opinion...Mr. Crouch was telling me... They'll be announcing their engagement any day now.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Hello, Professor McGonagall,\" said Moody calmly, bouncing the ferret still higher.\n\n\"What - what are you doing?\" said Professor McGonagall, her eyes following the bouncing ferret's progress through the air.\n\n\"Teaching,\" said Moody.\n\n\"Teach - Moody, is that a student?\" shrieked Professor McGonagall, the books spilling out of her arms.\n\n\"Yep,\" said Moody."
    },
    {
        "Book": "IV",
        "Quote": "\"I shudder to think what the state of my in-tray would be in if I was away from work for five days.\"\n\n\"Yeah, someone might slip dragon dung in it again, eh, Perce?\" said Fred.\n\n\"That was a sample of fertiliser from Norway!\" said Percy, going very red in the face. \"It was nothing personal!\"\n\n\"It was,\" Fred whispered to Harry as they got up from the table. \"We sent it.\""
    },
    {
        "Book": "IV",
        "Quote": "\"It is my very great pleasure to inform you that the Triwizard Tournament will be taking place at Hogwarts this year.\"\n\n\"You're JOKING!\" said Fred Weasley loudly.\n\nThe tension that had filled the Hall since Moody's arrival suddenly broke. Nearly everyone laughed, and Dumbledore chuckled appreciatively.\n\n\"I am not joking, Mr. Weasley,\" he said, \"though now that you mention it, I did hear an excellent one over the summer about a troll, a hag and a leprechaun who all go into a bar - \"\n\nProfessor McGonagall cleared her throat loudly.\n\n\"Er - but maybe this is not the time...no...\" said Dumbledore."
    },
    {
        "Book": "IV",
        "Quote": "\"Mad-Eye Moody?\" said George thoughtfully, spreading marmalade on his toast. \"Isn't he that nutter -\"\n\n\"Your father thinks very highly of Mad-Eye Moody,\" said Mrs. Weasley sternly.\n\n\"Yeah, well, Dad collects plugs, doesn't he?\" said Fred quietly, as Mrs. Weasley left the room. \"Birds of a feather...\""
    },
    {
        "Book": "IV",
        "Quote": "\"My own brother, Aberforth, was prosecuted for practising inappropriate charms on a goat. It was all over the papers, but did Aberforth hide? No, he did not! He held his head high and went about his business as usual! Of course, I'm not entirely sure he can read, so that may not have been bravery...\""
    },
    {
        "Book": "IV",
        "Quote": "\"Percy wouldn't recognise a joke if it danced naked in front of him wearing Dobby's tea-cozy.\""
    },
    {
        "Book": "IV",
        "Quote": "\"Perhaps Amos is suggesting,\" said Mr. Crouch, cold word in every syllable, \"that I routinely teach my servants to conjure the Dark Mark?\""
    },
    {
        "Book": "IV",
        "Quote": "\"We're trying to standardise cauldron thickness. Some of these foreign imports are just a shade too thin - leakages have been increasing at a rate of almost three per cent a year -\"\n\n\"That'll change the world, that report will,\" said Ron. \"Front page of the Daily Prophet, I expect, cauldron leaks.\""
    },
    {
        "Book": "IV",
        "Quote": "\"You know your mother, Malfoy? That expression she's got, like she's got dung under her nose? Has she always looked like that, or was it just because you were with her?\""
    },
    {
        "Book": "IV",
        "Quote": "But Ron was staring at Hermione as though suddenly seeing her in a whole new light.\n\n\"Hermione, Neville's right - you are a girl... \"\n\n\"Oh well spotted,\" she said acidly.\""
    },
    {
        "Book": "IV",
        "Quote": "Dudley looked furious and sulky, and somehow seemed to be taking up even more space than usual. This was saying something, as he always took up an entire side of the square table by himself."
    },
    {
        "Book": "IV",
        "Quote": "Dudley was still clutching his bottom as though afraid it might fall off."
    },
    {
        "Book": "IV",
        "Quote": "Harry would have dearly loved to have said, \"So what?\" but he didn't feel that Uncle Vernon's temper should be tested this early in the morning, especially when it was under severe strain from lack of food."
    },
    {
        "Book": "IV",
        "Quote": "One of them was a very old wizard who was wearing a long flowery nightgown. The other was clearly a Ministry wizard; he was holding out a pair of pinstriped trousers and almost crying with exasperation.\n\n\"Just put them on, Archie, there's a good chap. You can't walk around like that, the Muggle at the gate's already getting suspicious-\"\n\n\"I bought this in a Muggle shop,\" said the old wizard stubbornly. \"Muggles wear them.\"\n\n\"Muggle women wear them, Archie, not the men, they wear these,\" said the Ministry wizard, and he brandished the pinstriped trousers.\n\n\"I'm not putting them on,\" said old Archie in indignation. \"I like a healthy breeze \"round my privates, thanks.\""
    },
    {
        "Book": "IV",
        "Quote": "The school nurse had seen what Aunt Petunia's eyes - so sharp when it came to spotting fingerprints on her gleaming walls, and in her comings and goings of her neighbors- simply refused to see: that far from needing extra nourishment, Dudley had reached roughly the size and weight of a young killer whale."
    },
    {
        "Book": "IV",
        "Quote": "They also skated over the accusations in the report.  \"He's a boisterous little boy, but he wouldn't hurt a fly!\" Aunt Petunia said tearfully."
    },
    {
        "Book": "IV",
        "Quote": "Yes,\" said Harry. \"Professor - I was in Divination just now, and - er - I fell asleep.\"\n\nHe hesitated here, wondering if a reprimand was coming, but Dumbledore merely said, \"Quite understandable. Continue.\""
    },
    {
        "Book": "V",
        "Quote": "\"Well, I'm terrified now, \" said Harry sarcastically. \"I s\" pose Lord Voldemort's just a warm-up act compared to you three - what's the matter? \" he added, for Malfoy Crabbe and Goyle had all looked stricken at the sound of the name. \"He's a mate of your dad, isn't he? Not scared of him, are you? \"\n\n\"You think you're such a big man, Potter, \" said Malfoy, advancing now, Crabbe and Goyle flanking him. \"You wait. I'll have you. You can't land my father in prison -\"\n\n\"I thought I just had,\" said Harry."
    },
    {
        "Book": "V",
        "Quote": "\"- we couldn't fit in useless loser either - for his father, you know -\""
    },
    {
        "Book": "V",
        "Quote": "\"An interview?\" repeated Umbridge, her voice thinner and higher than ever. \"What do you mean?\"\n\n\"I mean a reporter asked me questions and I answered them,\" said Harry."
    },
    {
        "Book": "V",
        "Quote": "\"And do I look like the kind of man that can be intimidated?\" barked Uncle Vernon.\n\n\"Well...\" said Moody, pushing back his bowler hat to reveal his sinisterly revolving eye. Uncle Vernon lept backward in horror and collided painfully with a luggage trolley. \"Yes, I'd have to say you do, Dursley.\""
    },
    {
        "Book": "V",
        "Quote": "\"Are you quite sure you wouldn't like a cough drop, Dolores?\" "
    },
    {
        "Book": "V",
        "Quote": "\"But you get these massive pus-filled boils, too,\" said George, \"and we haven't worked out how to get rid of them yet.\"\n\n\"I can't see any boils,\" said Ron, staring at the twins.\n\n\"No, well, you wouldn't,\" said Fred darkly, \"they're not in a place we generally display to the public.\""
    },
    {
        "Book": "V",
        "Quote": "\"Cheers,\" whispered George, wiping tears of laughter from his face.\n\n\"Oh, I hope she tries Vanishing them next...they multiply by ten every time you try...\" "
    },
    {
        "Book": "V",
        "Quote": "\"Don't be silly, Dawlish. I'm sure you are an excellent Auror, I seem to remember you achieved \"Outstanding\" in all your N.E.W.T.s, but if you attempt to - er - \"bring me in\" by force, I will have to hurt you.\""
    },
    {
        "Book": "V",
        "Quote": "\"Git,\" said Fred idly."
    },
    {
        "Book": "V",
        "Quote": "\"Give her hell from us, Peeves.\""
    },
    {
        "Book": "V",
        "Quote": "\"Has Ron saved a goal yet?\" asked Hermione.\n\n\"Well, he can do it if he thinks no one is watching him,\" said Fred, rolling his eyes. \"So all we have to do is ask the crowd to turn their backs and talk among themselves every time the Quaffle goes up on his end Saturday.\" "
    },
    {
        "Book": "V",
        "Quote": "\"His life's ambition is to have his head cut off and stuck up on a plaque just like his mother,\" said Ron irritably. \"Is that normal, Hermione?\" "
    },
    {
        "Book": "V",
        "Quote": "\"I'm very well indeed, thank you!\" said Lockhart exuberantly, pulling a rather battered peacock-feather quill from his pocket. \"Now, how many autographs would you like? I can do joined-up writing now, you know!\""
    },
    {
        "Book": "V",
        "Quote": "\"It unscrews the other way.\""
    },
    {
        "Book": "V",
        "Quote": "\"Just thinking...\" she said, still frowning.\n\n\"About Siri -- Snuffles?\" said Harry.\n\n\"No...not exactly...\" said Hermione slowly. \"More...wondering...I suppose we're doing the right thing...I think....aren't we?\"\n\nHarry and Ron looked at each other.\n\n\"Well, that clears that up,\" said Ron. \"It would have been really annoying if you hadn't explained yourself properly.\" "
    },
    {
        "Book": "V",
        "Quote": "\"Keep muttering and I will be a murderer!\""
    },
    {
        "Book": "V",
        "Quote": "\"Kreacher is cleaning,\" the elf repeated. \"Kreacher lives to serve the noble house of Black-\" \n\n\"-and it's getting blacker every day, it's filthy,\" said Sirius. "
    },
    {
        "Book": "V",
        "Quote": "\"Manners, Potter, or I'll have to give you a detention,\" drawled Malfoy, whose sleek blond hair and pointed chin were just like his father's. \"You see, I, unlike you, have been made a prefect, which means that I, unlike you, have the power to hand out punishments.\"\n\n\"Yeah,\" said Harry, \"but you, unlike me, are a git, so get out and leave us alone.\""
    },
    {
        "Book": "V",
        "Quote": "\"Not as stupid as you look, are you, Dud? But I s'pose if you were, you wouldn't be able to walk and talk at the same time...\""
    },
    {
        "Book": "V",
        "Quote": "\"Reading between the lines, I'd say she thinks you're a bit conceited, mate.\""
    },
    {
        "Book": "V",
        "Quote": "\"Ron,\" said Hermione in a dignified voice, \"you are the most insensitive wart I have ever had the misfortune to meet.\""
    },
    {
        "Book": "V",
        "Quote": "\"The hats have gone,\" Hermione said happily. \"Seems the house-elves do want freedom after all.\"\n\n\"I wouldn't bet on it,\" Ron told her cuttingly. \"They might not count as clothes. They didn't look anything like hats to me, more like woolly bladders.\" "
    },
    {
        "Book": "V",
        "Quote": "\"They've always said only prats become prefects...\""
    },
    {
        "Book": "V",
        "Quote": "\"This is night, Diddykins. That what we call it when it goes all dark like this...\""
    },
    {
        "Book": "V",
        "Quote": "\"Warrington's aim's so pathetic I'd be more worried if he was aiming for the person next to me.\" "
    },
    {
        "Book": "V",
        "Quote": "\"We're going to have to watch our step, George,\" said Fred, pretending to tremble, \"with these two on our case...\"\n\n\"Yeah, it looks like our law-breaking days are finally over,\" said George, shaking his head."
    },
    {
        "Book": "V",
        "Quote": "\"Well, we were always going to fail that one,\" said Ron gloomily as they ascended the marble staircase. He had just made Harry feel rather better by telling him how he told the examiner in detail about the ugly man with a wart on his nose in the crystal ball, only to look up and realize he had been describing the examiner's reflection. "
    },
    {
        "Book": "V",
        "Quote": "\"What's that supposed to be anyway?\" asked Fred, squinting at Dobby's painting. \"Looks like a gibbon with two black eyes.\"\n\n\"It's Harry!\" said George, pointing at the back of the picture, \"says so on the back!\"\n\n\"Good likeness,\" said Fred, grinning."
    },
    {
        "Book": "V",
        "Quote": "\"Would you like us to clean out your ears for you?\" enquired George, pulling a long and lethal-looking metal instrument from inside one of the Zonko's bags.\n\n\"Or any part of your body, really, we're not fussy where we stick this,\" said Fred."
    },
    {
        "Book": "V",
        "Quote": "\"Yeah, Montague tried to do us during break,\" said George.\n\n\"What do you mean, \"tried'?\" said Ron quickly.\n\n\"He never managed to get all the words out,\" said Fred, \"due to the fact that we forced him head-first into that Vanishing Cabinet on the first floor.\"\n\nHermione looked very shocked.\n\n\"But you'll get into terrible trouble!\"\n\n\"Not until Montague reappears, and that could take weeks, I dunno where we sent him,\" said Fred coolly. "
    },
    {
        "Book": "V",
        "Quote": "\"Yeah, Quirrell was a great teacher. There was just that minor drawback of him having Lord Voldemort sticking out of the back of his head!\""
    },
    {
        "Book": "V",
        "Quote": "\"Yeah? Did he say you look like a pig that's been taught to walk on it's hind legs? Cause that's not cheek, Dud. That's true.\""
    },
    {
        "Book": "V",
        "Quote": "\"Yes - yes, good point, Petunia! What were you doing under our window, boy?\"\n\n\"Listening to the news,\" said Harry in a resigned voice.\n\nHis aunt and uncle exchanged looks of outrage.\n\n\"Listening to the news! Again?\"\n\n\"Well, it changes every day, you see,\" said Harry."
    },
    {
        "Book": "V",
        "Quote": "\"You can't give a Dementor the old one-two!\""
    },
    {
        "Book": "V",
        "Quote": "\"You don't want to bottle your anger up like that, Harry, let it all out,\" said Fred, beaming. \"There might be a couple people fifty miles away who didn't hear you.\" "
    },
    {
        "Book": "V",
        "Quote": "\"You know, Minister, I disagree with Dumbledore on many counts...but you cannot deny he's got style...\" "
    },
    {
        "Book": "V",
        "Quote": "\"You two just Apparated on my knees!\"\n\n\"Yeah, well, it's harder in the dark --\" "
    },
    {
        "Book": "V",
        "Quote": "\"And that complete cow Pansy Parkinson,\" said Hermione viciously. \"How she got to be a prefect when she's thicker than a concussed troll...\""
    },
    {
        "Book": "V",
        "Quote": "\"Harry, yours is OK except for this bit at the end, I think you must have misheard Professor Sinistra, Europa's covered in ice, not mice - \""
    },
    {
        "Book": "V",
        "Quote": "\"Have a biscuit, Potter.\""
    },
    {
        "Book": "V",
        "Quote": "\"I'll make Goyle do lines, it'll kill him, he hates writing,\" said Ron happily. He lowered his voice to Goyle's low grunt and, screwing up his face in a look of pained concentration, mimed writing in midair. \"I...must...not...look...like...a...baboon's...backside...\""
    },
    {
        "Book": "V",
        "Quote": "\"Just because you've got the emotional range of a teaspoon doesn't mean we all have,\" said Hermione nastily, picking up her quill again."
    },
    {
        "Book": "V",
        "Quote": "\"Ron, we're supposed to show the first-years where to go!\"\n\n\"Oh yeah,\" said Ron, who had obviously forgotten. \"Hey - hey, you lot! Midgets!\"\n\n\"Ron!\"\n\n\"Well, they are, they're titchy...\""
    },
    {
        "Book": "V",
        "Quote": "By the time Ernie Macmillan, Hannah Abbott, Susan Bones, Justin Finch-Fletchley, Anthony Goldstein and Terry Boot had finished using a wide variety of the hexes and jinxes Harry had taught them, Malfoy, Crabbe and Goyle resembled nothing so much as three gigantic slugs squeezed into Hogwarts uniform as Harry, Ernie and Justin hoisted them into the luggage rack and left them there to ooze.\n\n\"I must say, I'm looking forward to seeing Malfoy's mother's face when he gets off the train,\" said Ernie, with some satisfaction, as he watched Malfoy squirm above him. Ernie had never quite got over the indignity of Malfoy docking points from Hufflepuff during his brief spell as a member of the Inquisitorial Squad.\n\n\"Goyle's mum'll be really pleased, though,\" said Ron, who had come to investigate the source of the commotion. \"He's loads better-looking now ..."
    },
    {
        "Book": "V",
        "Quote": "Excellent,\" said Lupin, looking up as Tonks and Harry entered. \"We've got about a minute, I think. We should probably get out into the garden so we're ready. Harry, I've left a letter telling your aunt and uncle not to worry-\"\n\n\"They won't,\" said Harry\n\n\"-that you're safe-\"\n\n\"That'll just depress them.\"\n\n\"-and you'll see them next summer.\"\n\n\"Do I have to?\""
    },
    {
        "Book": "V",
        "Quote": "Harry frequently heard students saying things like, \"Honestly, some days I just feel like jumping on my broom and leaving this place,\" or else, \"One more lesson like that and I might just do a Weasley.\""
    },
    {
        "Book": "V",
        "Quote": "Hermione drew herself to her full height; her eyes were narrowed and her hair seemed to crackle with electricity.\n\n\"No,\" she said, her voice quivering with anger, \"but I will write to your mother.\"\n\n\"You wouldn't,\" said George, horrified, taking a step back from her.\n\n\"Oh, yes, I would,\" said Hermione grimly. \"I can't stop you from eating the stupid things yourself, but you're not giving them to first years.\"\n\nFred and George looked thunderstruck. It was clear that as far as they were concerned, Hermione's threat was way below the belt. "
    },
    {
        "Book": "V",
        "Quote": "Malfoy glanced around - Harry knew he was checking for signs of teachers - then he looked back at Harry and said in a low voice, \"You're dead, Potter.\"\n\nHarry raised his eyebrows. \"Funny,\" he said, \"you'd think I'd have stopped walking around...\""
    },
    {
        "Book": "V",
        "Quote": "Mrs. Weasley let out a shriek just like Hermione's.\n\n\"I don't believe it!\" Oh, Ron, how wonderful! A prefect! That's everyone in the family!\"\n\n\"What are Fred and I, next-door neighbours?\" said George indignantly, as his mother pushed him aside and flung her arms around her youngest son."
    },
    {
        "Book": "V",
        "Quote": "Mrs. Weasley was wiping her face on her apron, and Fred, George and Ginny were doing a kind of war dance to a chant that went: \"He got off, he got off, he got off!'\""
    },
    {
        "Book": "V",
        "Quote": "\"So!\" said Umbridge triumphantly. Harry realized she was standing just a few stairs in front of him, once more looking down upon her prey. \"So-you think it amusing to turn a school corridor into a swamp, do you?\"\n\n\"Pretty amusing, yeah,\" said Fred, looking up at her without the slightest sign of fear. "
    },
    {
        "Book": "VI",
        "Quote": "\"- yet, sadly, accidental rudeness occurs alarmingly often. Best to say nothing at all, my dear man.\""
    },
    {
        "Book": "VI",
        "Quote": "\"And that's Smith of Hufflepuff with the Quaffle,\" said a dreamy voice, echoing over the grounds. \"He did the commentary last time, of course, and Ginny Weasley flew into him, I think probably on purpose, it looked like it. Smith was being quite rude about Gryffindor, I expect he regrets that now he's playing them - oh, look, he's lost the Quaffle. Ginny took it from him. I do like her, she's very nice...\""
    },
    {
        "Book": "VI",
        "Quote": "\"Do you remember me telling you we are practicing nonverbal spells, Potter?\"\n\n\"Yes,\" said Harry stiffly.\n\n\"Yes, sir.\"\n\n\"There's no need to call me \"sir,\" Professor.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Fred reckons his left buttock has never been the same since.\"\n\n\"Yeah, well, passing over Fred's left buttock -\"\n\n\"I beg your pardon?\" said Fred's voice as the twins entered the kitchen."
    },
    {
        "Book": "VI",
        "Quote": "\"I am a wizard, not a baboon brandishing a stick.\""
    },
    {
        "Book": "VI",
        "Quote": "\"I don't think you should be an Auror, Harry,\" said Luna unexpectedly. Everybody looked at her. \"The Aurors are part of the Rotfang Conspiracy, I thought everyone knew that. They're planning to bring down the Ministry of Magic from within using a combination of Dark Magic and gum disease.\""
    },
    {
        "Book": "VI",
        "Quote": "\"I see a light in the kitchen. Let us not deprive Molly any longer of the chance to deplore how thin you are.\""
    },
    {
        "Book": "VI",
        "Quote": "\"I take my hat off to you--or I would, if I were not afraid of showering you with spiders.\""
    },
    {
        "Book": "VI",
        "Quote": "\"I would assume that you were going to offer me refreshment,\" Dumbledore said to Uncle Vernon, \"but the evidence so far suggests that that would be optimistic to the point of foolishness.\""
    },
    {
        "Book": "VI",
        "Quote": "\"If I'm having lessons with you, I won't have to do Occlumency with Snape, will I?\"\n\n\"Professor Snape, Harry - and no, you will not.\"\n\n\"Good,\" said Harry in relief, \"because they were a -\"\n\n\"I think the word \"fiasco\" would be a good one here.\""
    },
    {
        "Book": "VI",
        "Quote": "\"It is a long time since my last visit,\" said Dumbledore, peering down his crooked nose at Uncle Vernon. \"I must say, your agapanthuses are flourishing.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Never mind her,\" said Harry, a little impatiently. \"What did Ginny and Dean row about, Hermione?\"\n\n\"Oh, Dean was laughing about McLaggen hitting that Bludger at you,\" said Hermione.\n\n\"It must've looked funny,\" said Ron reasonably. "
    },
    {
        "Book": "VI",
        "Quote": "\"No, I was merely reading the Muggle magazines,\" said Dumbledore. \"I do love knitting patterns.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Oh, very good,\" interrupted Snape, his lip curling. \"Yes, it is easy to see that nearly six years of magical education have not been wasted on you, Potter. \"Ghosts are transparent.'\""
    },
    {
        "Book": "VI",
        "Quote": "\"There's a boy been in here crying?\" asked Harry curiously. \"A young boy?\"\n\n\"Never you mind,\" said Myrtle, her small, leaky eyes fixed on Ron, who was now definitely grinning. \"I promised I wouldn't tell anyone, and I take his secret to the-\"\n\n\"-not to the grave, surely?\" snorted Ron. \"The sewers maybe...\""
    },
    {
        "Book": "VI",
        "Quote": "\"This is your copy of Advanced Potion-Making, is it, Potter?\"\n\n\"Yes,\" said Harry, still breathing hard.\n\n\"You're quite sure of that, are you, Potter?\"\n\n\"Yes,\" said Harry, with a touch of more defiance.\n\n\"This is the the copy of Advanced Potion-Making that you purchased from Flourish and Blotts?\"\n\n\"Yes,\" said Harry firmly.\n\n\"Then why,\" asked Snape, \"does it have the name \"Roonil Wazlib\" written inside the front cover?\""
    },
    {
        "Book": "VI",
        "Quote": "\"Well, think back,\" said Harry. \"Have you ever let it slip that you'd like to go out in public with the words \"My Sweetheart\" round your neck?\" "
    },
    {
        "Book": "VI",
        "Quote": "\"Women,\" he said wisely to Harry, \"they're easily upset.\" \n\n\"And yet,\" said Hermione, coming out of her reverie, \"I doubt you'd find a woman who sulked for half an hour because Madam Rosmerta didn't laugh at their joke about the hag, the Healer, and the Mimbulus mimbletonia.\""
    },
    {
        "Book": "VI",
        "Quote": "\"You'd think people had better things to gossip about,\" said Ginny as she sat on the common room floor, leaning against Harry's legs and reading the Daily Prophet. \"Three Dementor attacks in a week, and all Romilda Vane does is ask me if it's true you've got a Hippogriff tattooed across your chest.\"\n\nRon and Hermione both roared with laughter. Harry ignored them.\n\n\"What did you tell her?\"\n\n\"I told her it's a Hungarian Horntail,\" said Ginny, turning a page of the newspaper idly. \"Much more macho.\"\n\n\"Thanks,\" said Harry, grinning. \"And what did you tell her Ron's got?\"\n\n\"A Pygmy Puff, but I didn't say where.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Its one of Fred and George's Spell-Checking ones...but I think the charm must be wearing off...\"\n\n\"Yes, it must,\" said Hermione, pointing at the title of his essay, \"because we were asked how we'd deal with Dementors, not \"Dugbogs', and I don't remember you changing your name to \"Roonil Wazlib', either.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Sir - I got a Ministry of Magic leaflet by owl, about security measures we should all take against the Death Eaters...\"\n\n\"Yes I received one myself,\" said Dumbledore, still smiling. \"Did you find it useful?\"\n\n\"Not really.\"\n\n\"No I thought not. You have not asked me, for instance, what is my favourite flavour of jam, to check that I am indeed Professor Dumbledore, and not an impostor.\"\n\n\"I didn't...\" Harry began, not entirely sure whether he was being reprimanded or not.\n\n\"For future reference, Harry, it is raspberry...although of course, if I were a Death Eater, I would have been sure to research my own jam preferences before impersonating myself.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Well, you can't break an Unbreakable Vow...\"\n\n\"I'd worked that much out for myself, funnily enough.\""
    },
    {
        "Book": "VI",
        "Quote": "\"When you say you have lots in common,\" said Ron, sounding rather amused now, do you mean he lives in an S-bend, too?\"\n\n\"No,\" said Myrtle defiantly, her voice echoing loudly around the old tiled bathroom. \"I mean he's sensitive, people bully him, too, and he feels lonely and hasn't got anybody to talk to, and he's not afraid to show his feelings and cry!\" "
    },
    {
        "Book": "VI",
        "Quote": "Fred, George, Harry, and Ron were the only ones who knew that the angel on top of the tree was actually a garden gnome that had bitten Fred on the ankle as he pulled up carrots for Christmas dinner. Stupefied, painted gold, stuffed into a miniature tutu and with small wings glued to its back, it glowered down at them all, the ugliest angel Harry had ever seen, with a large bald head like a potato and rather hairy feet."
    },
    {
        "Book": "VI",
        "Quote": "Pointing his wand at nothing in particular, he gave it an upward flick and said Levicorpus! inside his head.\n\n\"Aaaaaaaargh!\"\n\nThere was a flash of light and the room was full of voices: Everyone had woken up as Ron had let out a yell. Harry sent Advanced Potion-Making flying in panic; Ron was dangling upside down in midair as though an invisible hook had hoisted him up by the ankle.\n\n\"Sorry!\" yelled Harry, as Dean and Seamus roared with laughter, and Neville picked himself up from the floor, having fallen out of bed. \"Hang on- I'll let you down-\"\n\nHe groped for the potion book and riffled through it in a panic, trying to find the right page; at last he located it and deciphered one cramped word underneath the spell: Praying that this was the counter-jinx, Harry thought Liberacorpus! with all his might.\n\nThere was another flash of light, and Ron fell in a heap onto his mattress.\n\n\"Sorry,\" repeated Harry weakly, while Dean and Seamus continued to roar with laughter.\n\n\"Tomorrow,\" said Ron in a muffled voice, \"I'd rather you set the alarm clock.\""
    },
    {
        "Book": "VI",
        "Quote": "\"Ron, you know full well Harry and I were brought up by Muggles!\" said Hermione. \"We didn't hear stories like that when we were little, we heard \"Snow White and the Seven Dwarfs\" and \"Cinderella'-\"\n\n\"What's that, an illness?\" asked Ron. "
    },
    {
        "Book": "VI",
        "Quote": "Why Are You Worrying about You-Know-Who?\n\nYou SHOULD Be Worrying About\n\nU-NO-POO - \n\nthe Constipation Sensation That's Gripping the Nation!"
    },
    {
        "Book": "VII",
        "Quote": "\"Well, I don't believe it,\" repeated Uncle Vernon, coming to a halt in front of Harry again. \"I was awake half the night thinking it all over, and I believe it's a plot to get the house.\"\n\n\"The house?\" repeated Harry. \"What house?\"\n\n\"This house!\" shrieked Uncle Vernon, the vein in his forehead starting to pulse. \"Our house! House prices are sky-rocketing round here! You want us out of the way and then you're going to do a bit of hocus-pocus and before we know it the deeds will be in your name and -\"\n\n\"Are you out of your mind?\" demanded Harry. \"A plot to get this house? Are you actually as stupid as you look?\"\n\n\"Don't you dare -!\" squealed Aunt Petunia, but again, Vernon waved her down: slights on his personal appearance were, it seemed, as nothing to the danger he had spotted.\n\n\"Just in case you've forgotten,\" said Harry, \"I've already got a house, my godfather left me one. So why would I want this one? All the happy memories?\""
    },
    {
        "Book": "VII",
        "Quote": "\"...the fact remains he can move faster than Severus Snape confronted with shampoo when he wants to, so don't count on him being a long way away if you're planning on taking any risks.\""
    },
    {
        "Book": "VII",
        "Quote": "\"Blimey.... Did the dementors blow a different personality into you?\""
    },
    {
        "Book": "VII",
        "Quote": "\"Brains like that, you could be a Death Eater, son.  Haven't I just proved my Patronus is a goat?\""
    },
    {
        "Book": "VII",
        "Quote": "\"Expelliarmus is a useful spell, Harry, but the Death Eaters seem to think it is your signature move, and I urge you not to let it become so!\""
    },
    {
        "Book": "VII",
        "Quote": "\"For instance, this new idea that You-Know-Who can kill with a single glance from his eyes. That's a basilisk, listeners. One simple test: Check whether the thing that's glaring at you has got legs. If it has, it's safe to look into its eyes, although if it really is You-Know-Who, that's still likely to be the last thing you ever do.\""
    },
    {
        "Book": "VII",
        "Quote": "\"I ask this great favor of you, Severus, because death is coming for me as surely as the Chudley Cannons will finish bottom of this year's league.\""
    },
    {
        "Book": "VII",
        "Quote": "\"It's impossible to make good food out of nothing! You can Summon it if you know where it is, you can transform it, you can increase the quantity if you've already got some-\"\n\n\"Well, don't bother increasing this, it's disgusting,\" said Ron."
    },
    {
        "Book": "VII",
        "Quote": "\"Oh, I don't know!\" yelled Hermione with awful sarcasm.  \"Rack your brains, Ron, that should only take a couple of seconds-\""
    },
    {
        "Book": "VII",
        "Quote": "\"So that's little Scorpius,\"said Ron under his breath. \"Make sure you beat him in every test Rosie. Thank God you inherited your mother's brains.\"\n\n\"Ron, for heaven's sake,\"said Hermione, half stern, half amused. \"Don't try to turn them against each other before they've even started school!\"\n\n\"You're right, sorry,\" said Ron. But unable to help himself, he added, \"Don't get too friendly with him though, Rosie. Granddad Weasley would never forgive you if you married a pureblood.\""
    },
    {
        "Book": "VII",
        "Quote": "\"Then we'll have nothing to do except find Horcruxes.... It'll be like a holiday, won't it?\" "
    },
    {
        "Book": "VII",
        "Quote": "\"There was the sound of pattering feet, a blaze of shining copper, an echoing clang, and a shriek of agony: Kreacher had taken a run at Mundungus and hit him over the head with a saucepan.\n\n\"Call \"im off, call \"im off, \"e should be locked up!\" screamed Mundungus, cowering as Kreacher raised the heavy-bottomed pan again.\n\n\"Kreacher, no!\" Shouted Harry.\n\nKreacher's thin arms trembled with the weight of the pan, still held aloft. \"Perhaps just one more, Master Harry, for luck?\"\n\nRon laughed.\n\n\"We need him conscious, Kreacher, but if he needs persuading you can do the honors,\" said Harry.\n\n\"Thank you very much, Master.\" "
    },
    {
        "Book": "VII",
        "Quote": "\"We did it, we bashed them, wee Potter's the One,\nAnd Voldy's gone mouldy, so now let's have fun!\"\n\n\"Really gives a feeling for the scope and tragedy of the thing, doesn't it?\" said Ron, pushing open a door to let Harry and Hermione through."
    },
    {
        "Book": "VII",
        "Quote": "\"Who's in charge here?\" roared Greyback, covering his moment of inadequacy."
    },
    {
        "Book": "VII",
        "Quote": "\"Yeah, well, food's one of the five exceptions to Gamp's Law of Elemental Transfiguration,\" said Ron to general astonishment."
    },
    {
        "Book": "VII",
        "Quote": "\"All's fair in love and war,\" said Ron brightly, \"and this is a bit of both.\""
    },
    {
        "Book": "VII",
        "Quote": "\"And what in the name of Merlin's most baggy Y-fronts was that about?\""
    },
    {
        "Book": "VII",
        "Quote": "\"Arthur and Fred - \"\n\n\"I'm George,\" said the twin at whom Moody was pointing. \"Can't you even tell us apart when we're Harry?\"\n\n\"Sorry, George - \"\n\n\"I'm only yanking your wand, I'm Fred really - \"\n\n\"Enough messing around!\" snarled Moody. "
    },
    {
        "Book": "VII",
        "Quote": "\"But before [Uncle Bilius] went loopy he was the life and soul of the party,\" said Fred. \"He used to down an entire bottle of firewhisky, then run onto the dance floor, hoist up his robes, and start pulling bunches of flowers out of his-\" \"Yes, he sounds a real charmer,\" said Hermione, while Harry roared with laughter. \"Never married, for some reason,\" said Ron. "
    },
    {
        "Book": "VII",
        "Quote": "\"Daddy, look - one of the gnomes actually bit me!\"\n\n\"How wonderful! Gnome saliva is enormously beneficial!\" said Mr. Lovegood, seizing Luna's outstretched finger and examining the bleeding puncture marks. \"Luna, my love, if you should feel any burgeoning talent today - perhaps an unexpected urge to sing opera or to declaim in Mermish - do not repress it! You may have been gifted by the Gernumblies!\" "
    },
    {
        "Book": "VII",
        "Quote": "\"If you think I'm going to let six people risk their lives - !\" \n\n\" - because it's the first time for all of us,\" said Ron.\n\n\"This is different, pretending to be me - \"\n\n\"Well, none of us really fancy it, Harry,\" said Fred earnestly. \"Imagine if something went wrong and we were stuck as specky, scrawny gits forever.\""
    },
    {
        "Book": "VII",
        "Quote": "\"Look, if I picked up a sword right now, Ron, and ran you through with it, I wouldn't damage your soul at all.\"\n\n\"Which would be a real comfort to me, I'm sure,\" said Ron. "
    },
    {
        "Book": "VII",
        "Quote": "\"Maybe... maybe it's something you need to find out for yourself,\" said Hermione with a faint air of clutching at straws.\n\n\"Yeah,\" said Ron sycophantically, \"that makes sense.\"\n\n\"No it doesn't,\" snapped Hermione."
    },
    {
        "Book": "VII",
        "Quote": "\"What are you doing with all those books, anyway?\" Ron asked, limping back to his bed.\n\"Just trying to decide which ones to take with us,\" said Hermione. \"When we're looking for the Horcruxes.\"\n\"Oh, of course,\" said Ron, clapping a hand to his forehead. \"I forgot we'll be hunting down Voldemort in a mobile library.\""
    },
    {
        "Book": "VII",
        "Quote": "\"Saint-like,\" he murmured.\n\n\"What's wrong with him?\" croaked Fred, looking terrified. \"Is his mind affected?\"\n\n\"Saint-like,\" repeated George, opening his eyes and looking up at his brother. \"You see...I'm holy. Holey, Fred, geddit?\""
    },
    {
        "Book": "VII",
        "Quote": "\"Seventeen, eh!\" said Hagrid as he accepted a bucket-sized glass of wine from Fred. \n\n\"Six years to the day we met, Harry, d'yeh remember it?\" \n\n\"Vaguely,\" said Harry, grinning up at him. \"Didn't you smash down the front door, give Dudley a pig's tail, and tell me I was a wizard?\"\n\n\"I forge\" the details,\" Hagrid chortled. "
    },
    {
        "Book": "VII",
        "Quote": "\"You can't do it if I don't cooperate, you need me to give you some hair.\"\n\n\"Well, that's that plan scuppered,\" said George. \"Obviously there's no chance at all of us getting a bit of your hair unless you cooperate.\"\n\n\"Yeah, thirteen of us against one bloke who's not allowed to use magic; we've got no chance,\" said Fred. "
    },
    {
        "Book": "VII",
        "Quote": "Her voice was now so shrill only bats would be able to hear it soon, but she had reached a level of indignation that rendered her temporarily speechless."
    },
    {
        "Book": "VII",
        "Quote": "Hermione made purple and gold streamers erupt from the end of her wand and drape themselves artistically over the trees and bushes. \n\n\"Nice,\" said Ron, as with one final flourish of her wand, Hermione turned the leaves on the crabapple tree to gold. \"You've really got an eye for that sort of thing.\" \n\n\"Thank you, Ron!\" said Hermione, looking both pleased and a little confused. Harry turned away, smiling to himself.  He had a funny notion that he would find a chapter on compliments when he found time to peruse his copy of Twelve Fail-Safe Ways to Charm Witches. "
    },
    {
        "Book": "VII",
        "Quote": "Hermione threw herself down into a chair with her arms and legs crossed so tightly it seemed unlikely that she would unravel them for several years."
    },
    {
        "Book": "VII",
        "Quote": "Hermione: \"'And Death spoke to them - \"\"\n\n\"Sorry,\" interjected Harry, \"but Death spoke to them?\"\n\n\"It's a fairy tale, Harry!\n\n\"Right, sorry. Go on.\" "
    },
    {
        "Book": "VII",
        "Quote": "I was a fool!\" Percy roared, so loudly that Lupin nearly dropped his photograph. \"I was an idiot, I was a pompous prat, I was a - a -\"\n\n\"Ministry-loving, family-disowning, power-hungry moron,\" said Fred.\n\nPercy swallowed.\n\n\"Yes, I was!\""
    },
    {
        "Book": "VII",
        "Quote": "In fact, when all three of them were together Harry felt like the only non-mourner at a poorly attended funeral."
    },
    {
        "Book": "VII",
        "Quote": "The idea of a teenage Dumbledore was simply odd, like trying to imagine a stupid Hermione or a friendly blast-ended skrewt."
    },
    {
        "Book": "VII",
        "Quote": "There was a long moment of astonishment, broken by Fleur turning to Lupin and saying, in a wildly transparent attempt to break the tension, \"So - \"ow eez leetle Teddy?\""
    },
    {
        "Book": "VII",
        "Quote": "They were no match for her, even though there were four of them against one of her: she was a witch, as Harry knew, with prodigious skill and no conscience."
    },
    {
        "Book": "VII",
        "Quote": "When he straightened up again, there were six Harry Potters gasping and panting in front of him. Fred and George turned to each other and said together, \"Wow -- We're identical!\""
    },
    {
        "Book": "III",
        "Quote": "\"And what do I need with a bit of old parchment?\" said Harry.\n\n\"A bit of old parchment!\" said Fred, closing his eyes with a grimace as though Harry had mortally offended him."
    },
    {
        "Book": "VI",
        "Quote": "\"Nice commentary last match!\" said Ron to Luna as she took back the green onion, the toadstool, and the cat litter. Luna smiled vaguely.\n\n\"You're making fun of me, aren't you?\" she said. \"Everyone says I was dreadful.\"\n\n\"No, I'm serious!\" said Ron earnestly. \"I can't remember enjoying commentary more! What is this, by the way?\" he added, holding the onionlike object to eye level.\n\n\"Oh, it's a Gurdyroot,\" she said, stuffing the cat litter and the toadstool back into her bag. \"You can keep it if you like, I've got a few of them. They're really exciting for warding off Gulping Plimpies.\"\n\nAnd she walked away, leaving Ron chortling, still clutching the Gurdyroot.\n\n\"You know, she's grown on me, Luna,\" he said as they set again for the Great Hall. \"I know she's insane, but it's in a good-\""
    },
    {
        "Book": "VII",
        "Quote": "\"'IF WE DIE FOR THEM, I'LL KILL YOU, HARRY!'\""
    },
    {
        "Book": "III",
        "Quote": "\"So, young Harry,\" said Fred, in an uncanny impersonation of Percy, \"mind you behave yourself.\""
    },
    {
        "Book": "III",
        "Quote": "\"Urgh, no, Harry won't want one of those, they're for vampires, I expect,\" Hermione was saying.\n\n\"How about these?\" said Ron, shoving a jar of Cockroach Cluster under Hermione's nose.\n\n\"Definitely not,\" said Harry. Ron nearly dropped the jar.\n\n\"Harry!\" squealed Hermione. \"What are you doing here? How - how did you -?\"\n\n\"Wow!\" said Ron, looking very impressed. \"You've learnt to Apparate!\"\n\n\"Course I haven't,\" said Harry. "
    },
    {
        "Book": "I",
        "Quote": "\"Which way did they go, Peeves?\" Filch was saying. \"Quick, tell me.\"\n\n\"Say \"please'.\"\n\n\"Don't mess about, Peeves, now where did they go?\"\n\n\"Shan't say nothing if you don't say please,\" said Peeves in his annoying sing-song voice.\n\n\"All right - please.\"\n\n\"NOTHING! Ha haaa! Told you I wouldn\"t say nothing if you didn't say please! Ha ha! Haaaaaa!\""
    },
    {
        "Book": "I",
        "Quote": "Professor McGonagall pointed them into a classroom that was empty except for Peeves, who was busy writing rude words on the blackboard.\n\n\"Out, Peeves!\" she barked. Peeves threw the chalk into a bin, which clanged loudly, and he swooped out cursing. "
    },
    {
        "Book": "II",
        "Quote": "\"PEEVES!\" Filch roared, flinging down his quill in a transport of rage. \"I'll have you this time, I'll have you!\""
    },
    {
        "Book": "V",
        "Quote": "\"Peeves floated over them on his stomach, peashooter at the ready; automatically all three of them lifted their bags to cover their heads until he had passed.\""
    },
    {
        "Book": "V",
        "Quote": "The bell rang just as Peeves swooped down upon Katie and emptied an entire ink bottle over her head."
    },
    {
        "Book": "II",
        "Quote": "\"Oh Potter, you rotter, oh what have you done?\n\nYou're killing off students, you think it's good fun -\""
    },
    {
        "Book": "II",
        "Quote": "Ginny Weasley, who sat next to Colin Creevey in Charms, was distraught, but Harry felt that Fred and George were going the wrong way about cheering her up. They were taking turns covering themselves with fur or boils and jumpin out at her from behind statues."
    },
    {
        "Book": "II",
        "Quote": "Snape's upper lip was curling. Harry wondered why Lockhart was still smiling; if Snape had been looking at him like that he'd have been running as fast as he could in the opposite direction."
    },
    {
        "Book": "II",
        "Quote": "Ron shook his head. Both he and Hermione were looking as though someone had died. Harry couldn't see what was so terrible. \n\n\"D'you want to tell me what's wrong with stopping a massive snake biting off Justin's head?\" he said. \"What does it matter how I did it as long as Justin doesn't have to join the Headless Hunt?\" "
    },
    {
        "Book": "II",
        "Quote": "\"He kept popping up in the crowded corridors singing \"Oh Potter, you rotter ...', now with a dance-routine to match.\""
    },
    {
        "Book": "II",
        "Quote": "Lockhart, wearing lurid pink robes to match the decorations, was waving for silence. The teachers on either side of him were looking stony-faced. From where he sat, Harry could see a muscle going in Professor McGonagall's cheek. Snape looked as though someone had just fed him a large beaker of Skele-Gro."
    },
    {
        "Book": "II",
        "Quote": "\"Please, Hermione, tell me you weren't one of the forty-six,\" said Ron as they left the Great Hall for their first lesson. Hermione suddenly became very interested in searching her bag for her schedule and didn't answer."
    },
    {
        "Book": "II",
        "Quote": "\"His eyes are as green as a fresh pickled toad,\nHis hair is as dark as a blackboard.\nI wish he was mine, he's really divine,\nthe hero who conquered the Dark Lord.\""
    },
    {
        "Book": "II",
        "Quote": "It wasn't until they had reached Professor Flitwick's class that Harry noticed something rather odd about Riddle's diary. All his other books were drenched in scarlet ink. The diary, however, was as clean as it had been before the ink bottle had smashed all over it. He tried to point this out to Ron, but Ron was having trouble with his wand again; large purple bubbles were blossoming out of the end, and he wasn't much interested in anything else. "
    },
    {
        "Book": "II",
        "Quote": "Dean Thomas, who, like Harry, had grown up with Muggles, ended up closing his eyes and jabbing his wand at the list, then picking the subjects it landed on. "
    },
    {
        "Book": "II",
        "Quote": "But the only thing Harry felt he was really good at was Quidditch. In the end, he chose the same new subjects as Ron, feeling that if he was lousy at them, at least he'd have someone friendly to help him."
    },
    {
        "Book": "II",
        "Quote": "Their Invisibility Cloak didn't stop them making any noise, and there was a particularly tense moment when Ron stubbed his toe only yards from the spot where Snape stood standing guard. Thankfully, Snape sneezed at almost exactly the moment Ron swore. It was with relief that they reached the oak front doors and eased them open. "
    },
    {
        "Book": "II",
        "Quote": "\"Yeah, right,\" said Malfoy, smirking. \"I expect you'd have Father's vote, sir, if you wanted to apply for the job - I'll tell Father you're the best teacher here, sir -\"\n\nSnape smirked as he swept off around the dungeon, fortunately not spotting Seamus Finnigan, who was pretending to vomit into his cauldron. "
    },
    {
        "Book": "II",
        "Quote": "\"I'm quite surprised the Mudbloods haven't all packed their bags by now,\" Malfoy went on. \"Bet you five Galleons the next one dies. Pity it wasn't Granger -\" \n\nThe bell rang at that moment, which was lucky; at Malfoy's last words, Ron had leapt off his stool, and in the scramble to collect bags and books, his attempts to reach Malfoy went unnoticed. \n\n\"Let me at him,\" Ron growled as Harry and Dean hung onto his arms. \"I don't care, I don't need my wand, I'm going to kill him with my bare hands -\" "
    },
    {
        "Book": "II",
        "Quote": "\"That Draco Malfoy character,\" said Ernie, breaking off dead twigs, \"he seems very pleased about all this, doesn't he? D'you know, I think he might be Slytherin's heir.\" \n\n\"That's clever of you,\" said Ron, who didn't seem to have forgiven Ernie as readily as Harry. \n\n\"Do you think it's Malfoy, Harry?\" Ernie asked. \n\n\"No,\" said Harry, so firmly that Ernie and Hannah stared. "
    },
    {
        "Book": "II",
        "Quote": "\"What have we found out, I'd like to know?\" \n\n\"That Hagrid never opened the Chamber of Secrets,\" said Harry, throwing the cloak over Ron and prodding him in the arm to make him walk. \"He was innocent.\"\n\nRon gave a loud snort. Evidently, hatching Aragog in a cupboard wasn't his idea of being innocent. "
    },
    {
        "Book": "II",
        "Quote": "\"Can you imagine me taking exams with this?\" he asked Harry, holding up his wand, which had just started whistling loudly."
    },
    {
        "Book": "II",
        "Quote": "\"Mark my words,\" he said, ushering them around a corner. \"The first words out of those poor Petrified people's mouths will be \"It was Hagrid.\" Frankly, I'm astounded Professor McGonagall thinks all these security measures are necessary.\"\n\n\"I agree, sir,\" said Harry, making Ron drop his books in surprise. "
    },
    {
        "Book": "II",
        "Quote": "\"I really should go and prepare my next class -\" \n\nAnd he hurried off. \n\n\"Prepare his class,\" Ron sneered after him. \"Gone to curl his hair, more like.\" "
    },
    {
        "Book": "II",
        "Quote": "\"No, it's been a lot of work, Harry. It's not all book signings and publicity photos, you know. You want fame, you have to be prepared for a long hard slog.\""
    },
    {
        "Book": "II",
        "Quote": "\"You mean you're running away? said Harry disbelievingly. \"After all that stuff you did in your books -\"\n\n\"Books can be misleading,\" said Lockhart delicately.\n\n\"You wrote them!\" Harry shouted."
    },
    {
        "Book": "II",
        "Quote": "\"Oh, well... I'd just been thinking... if you had died, you'd have been welcome to share my toilet,\" said Myrtle, blushing silver. \n\n\"Urgh!\" said Ron as they left the bathroom for the dark, deserted corridor outside. \"Harry! I think Myrtle's grown fond of you! You've got competition, Ginny!\""
    },
    {
        "Book": "II",
        "Quote": "\"Am I a professor?\" said Lockhart in mild surprise. \"Goodness. I expect I was hopeless, was I?\" "
    },
    {
        "Book": "II",
        "Quote": "\"Dear me,\" said Dumbledore, shaking his head, his long silver mustache quivering. \"Impaled upon your own sword, Gilderoy!\"\n\n\"Sword?\" said Lockhart dimly. \"Haven't got a sword. That boy has, though.\" He pointed at Harry. \"He'll lend you one.\" "
    },
    {
        "Book": "II",
        "Quote": "The elf was doing something very odd. His great eyes fixed meaningfully on Harry, he kept pointing at the diary, then at Mr. Malfoy, and then hitting himself hard on the head with his fist. "
    },
    {
        "Book": "II",
        "Quote": "And still, behind his back, Dobby was pointing, first to the diary, then to Lucius Malfoy, then punching himself in the head. "
    },
    {
        "Book": "II",
        "Quote": "...unfortunately, Professor Lockhart would be unable to return next year, owing to the fact that he needed to go away and get his memory back. Quite a few of the teachers joined in the cheering that greeted this news. \n\n\"Shame,\" said Ron, helping himself to a jam doughnut. \"He was starting to grow on me.\""
    },
    {
        "Book": "III",
        "Quote": "\"Farewell!\" cried the knight, popping his head into a painting of some sinister-looking monks. \"Farewell, my comrades-in-arms! If ever you have need of noble heart and steely sinew, call upon Sir Cadogan!\"\n\"Yeah, we'll call you,\" muttered Ron, as the knight disappeared, \"if we ever need someone mental.\""
    }
]